# mysql과 python 연동
1. 라이브러리 설치
2. sql 서버의 정보를 등록
3. sql 서버에 접속
4. sql 쿼리문을 이용하여 데이터를 CRUD 작업

In [ ]:
# pymysql 설치
!pip install pymysql

In [ ]:
import pymysql

In [ ]:
# sql 서버의 정보를 입력
_db = pymysql.connect(
    user = 'root', 
    password = '1234', 
    host = 'localhost', 
    db = 'ubion_test', 
    port = 3306
)

In [ ]:
_db2 = pymysql.connect(
    user = 'ubion', 
    password = '1234', 
    host = 'localhost', 
    db = 'ubion7', 
    port = 3306
)

In [ ]:
# cursor변수 생성
# sql 쿼리문을 실행 시키지 위한 필수 변수
# Dictcursor는 sql 쿼리문이 실행되고 나온 데이터를 딕셔너리 형태로 받는다.
cursor = _db.cursor(pymysql.cursors.DictCursor)

In [ ]:
sql = """
    select 
    * 
    from 
    user_info
"""

cursor.execute(sql)

In [ ]:
result = cursor.fetchall()

In [ ]:
import pandas as pd

In [ ]:
pd.DataFrame(result)

In [ ]:
sql = """
    select 
    * 
    from 
    example
"""

cursor.execute(sql)
result = cursor.fetchall()
df = pd.DataFrame(result)
df

In [ ]:
sql = """
    insert into
    user_info 
    values 
    ("test5", "1234", "test5", "01011118888", 1)
"""

cursor.execute(sql)

In [ ]:
_db.commit()

### sql 함수화
1. 첫 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql 쿼리문을 실행하고 결과를 데이터프레임으로 변경하여 리턴
2. 두 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql 쿼리문을 실행하고 데이터베이스를 변경

3. 세 번째 함수
    - 1번 함수와 2번 함수를 하나의 함수에서 실행이 될수 있도록 생성

In [ ]:
def sql_select(sql):
    # 쿼리문 실행
    cursor.execute(sql)
    # 쿼리문에 대한 결과
    result = cursor.fetchall()
    df = pd.DataFrame(result)
    return df

In [ ]:
sql = """
    select
    * 
    from 
    user_info
"""
sql_select(sql)

In [ ]:
def _sql(sql, values):
    cursor.execute(sql, values)
    _db.commit()

In [ ]:
sql = """
    insert into 
    user_info 
    values 
    (%s, %s, %s, %s, %s)
"""

values = ["test10", "12234", "test10", "01077777777", 1]

_sql(sql, values)

In [ ]:
sql = """
    select 
    * 
    from 
    user_select
"""

sql.find('select')
sql.replace('\n', '').strip().startswith('select')

In [ ]:
def sql_query(sql, values = []):
    # if (sql.find("select") != -1) and (sql.find('select') < 10):
    if (sql.replace('\n', '').strip().startswith('select')):
        cursor.execute(sql, values)
        result = cursor.fetchall()
        result = pd.DataFrame(result)
    else:
        cursor.execute(sql, values)
        _db.commit()
        result = "Query OK"
    return result

In [ ]:
sql = """
    select 
    * 
    from
    user_info
"""

sql_query(sql)

In [ ]:
sql = """
    delete 
    from 
    user_info 
    where 
    user_id = %s
"""

values = ['test10']

sql_query(sql, values)

In [72]:
import mod_sql
import imp 
imp.reload(mod_sql)

C:\Users\moons\AppData\Local\Temp\ipykernel_8756\3559171020.py:2: DeprecationWarning: the imp module is deprecated in favour of importlib and slated for removal in Python 3.12; see the module's documentation for alternative uses
  import imp

In [81]:
test = mod_sql.Database(
    _host= 'localhost', 
    _user= 'root', 
    _pass = '1234', 
    _db = 'ubion', 
    _port = 3306)

In [ ]:
sql = """
    select 
    * 
    from 
    user_info
"""
test.sql_query(sql)

In [66]:
test2 = mod_sql.Database(
    '172.16.11.148', 
    'ubion', 
    '1234', 
    'ubion7', 
    3306
)

In [56]:
sql = """
    select 
    `Name` as '이름', 
    `Phone` as '휴대폰번호'
    from 
    example 
    where 
    `Gender` = %s
    limit 3
"""
values = ['female']
test.sql_query(sql, values)

  이름          휴대폰번호
0  B  010-1234-5679
1  D  010-1234-5681
2  F  010-1234-5683

In [68]:
sql = """
    select 
    * 
    from 
    user_info
"""

test2.sql_query(sql)

     user_id user_pass user_name    user_phone  user_gender
0     abcabc      9999    bbbccc   01012341234            1
1     teddd3   12343d5   tesdt12  0107377577d7            1
2  test11111      1234      test   01011111111            1
3     test99      1465    test99   01077777777            1

In [67]:
sql = """
    insert into 
    user_info 
    values 
    ("test11111", "1234", "test", "01011111111", 1)
"""

test2.sql_query(sql)

'Query OK'

In [71]:
sql =  """
    select 
    createDt as '등록일시', 
    deathCnt as '사망자', 
    decideCnt as '감염자' 
    from 
    corona
"""
test.sql_query(sql)

                        등록일시    사망자       감염자
0    2022-06-08 09:09:05.982  24305  18188200
1    2022-06-07 09:09:00.897  24299  18174842
2    2022-06-06 09:00:06.734  24279  18168670
3    2022-06-05 08:53:19.426  24258  18163648
4    2022-06-04 08:56:49.219  24238  18153814
..                       ...    ...       ...
815  2020-03-14 00:00:00.000     72      8086
816  2020-03-13 00:00:00.000     67      7979
817  2020-03-12 00:00:00.000     66      7869
818  2020-03-11 00:00:00.000     60      7755
819  2020-03-10 00:00:00.000     54      7513

[820 rows x 3 columns]

In [75]:
test.sql_close()

In [76]:
df =pd.read_csv("../csv/corona.csv")

In [77]:
df.head()

,Unnamed: 0,createDt,deathCnt,decideCnt,seq,stateDt,stateTime,updateDt,accExamCnt,accDefRate
0,0,2022-06-08 09:09:05.982,24305,18188200,904,20220608,00:00,NaN,NaN,NaN
1,1,2022-06-07 09:09:00.897,24299,18174842,903,20220607,00:00,2022-06-08 09:10:36.846,NaN,NaN
2,2,2022-06-06 09:00:06.734,24279,18168670,902,20220606,00:00,2022-06-08 09:10:50.441,NaN,NaN
3,3,2022-06-05 08:53:19.426,24258,18163648,901,20220605,00:00,2022-06-08 09:11:04.758,NaN,NaN
4,4,2022-06-04 08:56:49.219,24238,18153814,900,20220604,00:00,2022-06-08 09:11:26.303,NaN,NaN

In [78]:
df = df[['createDt', 'deathCnt', 'decideCnt']]
df.head()

                  createDt  deathCnt  decideCnt
0  2022-06-08 09:09:05.982     24305   18188200
1  2022-06-07 09:09:00.897     24299   18174842
2  2022-06-06 09:00:06.734     24279   18168670
3  2022-06-05 08:53:19.426     24258   18163648
4  2022-06-04 08:56:49.219     24238   18153814

In [79]:
df.columns = ['등록일시', '사망자', '감염자']
df.head()

                      등록일시    사망자       감염자
0  2022-06-08 09:09:05.982  24305  18188200
1  2022-06-07 09:09:00.897  24299  18174842
2  2022-06-06 09:00:06.734  24279  18168670
3  2022-06-05 08:53:19.426  24258  18163648
4  2022-06-04 08:56:49.219  24238  18153814

In [83]:
sql = """
    select 
    `Country` as '국가', 
    `Units Sold` as '판매개수', 
    `Unit Price` as '가격', 
    `Unit Cost` as '원가', 
    (`Units Sold` * `Unit Price`) as '총수익', 
    (`Units Sold` * `Unit Cost`) as '총비용', 
    (`Units Sold` * `Unit Price` - `Units Sold` * `Unit Cost`) as '총이윤'
    from 
    `Sales Records`
"""
test.sql_query(sql)

,국가,판매개수,가격,원가,총수익,총비용,총이윤
0,Chad,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Latvia,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Pakistan,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Democratic Republic of the Congo,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Czech Republic,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...
9995,Laos,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Liechtenstein,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Democratic Republic of the Congo,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,South Africa,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Mongolia,361,152.58,97.44,55081.38,35175.84,19905.54